app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "bird watching 101"], ["created_at", "2025-01-22 17:31:58.987958"], ["updated_at", "2025-01-22 17:31:58.987958"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "how to make foods"], ["updated_at", "2025-01-27 04:51:05.991922"], ["id", 2]]